example-doc/Models/Sequences/BasicSequencePart.mmd
sequenceDiagram
%%Generated by Modeler - do not change.
autonumber

actor user as User <<Actor>>

participant hr_frontend as HR Frontend <<Application>>

participant hr_backend as HR Backend <<Application>>

participant hr_database as HR Database <<Database>>

user ->> hr_frontend : addEmployee (Employee)
activate hr_frontend

hr_frontend ->> hr_backend : addEmployee (EmployeeDto)
activate hr_backend

hr_backend ->> hr_backend : Validate (EmployeeDto)
hr_backend ->> hr_database : addEmployee (SQL)
activate hr_database

hr_database -->> hr_backend : OK ()
deactivate hr_database

hr_backend -->> hr_frontend : OK ()
deactivate hr_backend

hr_frontend -->> user : OK ()
deactivate hr_frontend
